In [1]:
import pandas as pd

In [2]:
# Series => 1D labelled array -> individual DataFrame column
s = pd.Series([1, 2, 3, 4, 5])
print(s)
print(type(s))

#index
print(s[2])
print(s[4])

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
3
5

In [3]:
#Custom labels using index attribute
s = pd.Series([10, 23, 31, 45, 52], index = ["Hima", "Anil", "Subbu", "jammu", "Gouse"])

print(s)
print(s["jammu"])
print(s["Subbu"])
print(s.index)

Hima     10
Anil     23
Subbu    31
jammu    45
Gouse    52
dtype: int64
45
31
Index(['Hima', 'Anil', 'Subbu', 'jammu', 'Gouse'], dtype='object')

In [4]:
# Series Properties
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([10, 23, 31, 45, 52])

print(s1 + s2)

#mutable values but immutable size
s1[1] = 20
changed_s1 = s1.drop(1)

print(s1)
print(changed_s1)

0    11
1    25
2    34
3    49
4    57
dtype: int64
0     1
1    20
2     3
3     4
4     5
dtype: int64
0    1
2    3
3    4
4    5
dtype: int64

In [5]:
# DataFrame => 2D labelled array

# Dictionary of list
info = {
    "Name": ["Hima", "Anil", "Subbu"],
    "Age": [22, 23, 24],
    "CGPA": [8.5, 8.6, 9.1]
}

df = pd.DataFrame(info)
print(df, type(df))
print(df.index)
print(df.columns)

    Name  Age  CGPA
0   Hima   22   8.5
1   Anil   23   8.6
2  Subbu   24   9.1 <class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'CGPA'], dtype='object')

In [6]:
df

    Name  Age  CGPA
0   Hima   22   8.5
1   Anil   23   8.6
2  Subbu   24   9.1

In [7]:
# list of list
df = pd.DataFrame([["Hima", 22], ["Anil", 23], ["Subbu", 24]], columns=["Name", "Age"] )

print(df)

    Name  Age
0   Hima   22
1   Anil   23
2  Subbu   24

In [8]:
# Using numpy arrays
import numpy as np

np_arr = np.array([[1, 2, 3], [4, 5, 6]])

df = pd.DataFrame(np_arr, columns=["A", "B", "C"])

print(df)

   A  B  C
0  1  2  3
1  4  5  6

In [10]:
# Reading data

#csv data
df = pd.read_csv("raw_data.csv")

print(df, type(df))

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0 <class 'pandas.core.frame.DataFrame'>

In [13]:
# DataFrame Methods
df.head() # starting 5 rows
df.tail() # last 5 rows
# df.tail(2) # last 2 rows
# df.sample() # random sample value (1 row)
# df.info() # summary of data
# df.shape # returns tuples
# df.describe() # gives important info about the numerical vales/data
# df.columns
# df.nunique() # total no.of unique rows

    id         name   age country  gender   income
6    6          NaN  45.0   India  Female  73000.0
7    7   Ahmed Khan  38.0     NaN    Male  68000.0
8    8   Rachel Lee  29.0     USA  Female  62000.0
9    9  Carlos Ruiz   NaN  Mexico    Male  45000.0
10  10  Emily Davis  31.0     USA     NaN  58000.0